Revit 2020 API
FormatOptions.CanSuppressLeadingZeros Method (DisplayUnitType)
 Checks whether leading zeros can be suppressed for a given display unit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2014
Syntax
C#
public static bool CanSuppressLeadingZeros(
	DisplayUnitType displayUnit
)
Visual Basic
Public Shared Function CanSuppressLeadingZeros ( _
	displayUnit As DisplayUnitType _
) As Boolean
Visual C++
public:
static bool CanSuppressLeadingZeros(
	DisplayUnitType displayUnit
)
Parameters
displayUnit
Type: Autodesk.Revit.DB.DisplayUnitType
 The display unit.
Return Value
 True if leading zeros can be suppressed, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  displayUnit is an invalid display unit. See UnitUtils.IsValidDisplayUnit(DisplayUnitType) and UnitUtils.GetValidDisplayUnits().
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
FormatOptions Class
CanSuppressLeadingZeros Overload
Autodesk.Revit.DB Namespace